In [1]:
import pandas as pd

## Pandas Serileri

In [2]:
pd.Series([1,2,3,4,5]) # ilk sütun index, ikinci sütun değerler

0    1
1    2
2    3
3    4
4    5
dtype: int64

Pandas veritipleri değerleri indexlerle beraber tutar internal şekilde.

In [3]:
s = pd.Series([10,88,3,4,5])
type(s)

pandas.core.series.Series

In [4]:
s.axes # index bilgileri (0'dan 5'e kadar)

[RangeIndex(start=0, stop=5, step=1)]

In [5]:
s.dtype

dtype('int64')

In [6]:
s.size

5

In [7]:
s.ndim

1

In [8]:
s.values # array formunda sadece değer bilgisine ulaşmak için kullanılır.

array([10, 88,  3,  4,  5], dtype=int64)

In [9]:
s.head(3) # ilk 3 elemanı getirir.

0    10
1    88
2     3
dtype: int64

In [10]:
s.tail(2) # son 2 elemanı getirir.

3    4
4    5
dtype: int64

In [11]:
pd.Series([99,22,232,94,5], index=[1,3,5,7,9]) # indexleri biz isimlendirmek istersek

1     99
3     22
5    232
7     94
9      5
dtype: int64

In [12]:
pd.Series([99,22,232,94,5], index=["a","b","c","d","e"]) # string ile isimlendirme

a     99
b     22
c    232
d     94
e      5
dtype: int64

In [13]:
s = pd.Series([99,22,232,94,5], index=["a","b","c","d","e"])
s["a"] # isimlendirilen index ile erişim

99

In [14]:
s["a":"c"] # isimlendirilen index ile slicing (c de dahil!!!)

a     99
b     22
c    232
dtype: int64

In [15]:
tempDic = {"reg":10,"log":11,"cart":12} # dictionary ile seri oluşturma
d = pd.Series(tempDic)
d

reg     10
log     11
cart    12
dtype: int64

In [16]:
pd.concat([d,d]) # iki seriyi birleştirerek seri oluşturma

reg     10
log     11
cart    12
reg     10
log     11
cart    12
dtype: int64

In [17]:
import numpy as np # numpy arrayi ile seri oluşturma
a = np.array([1,2,3,444,75])
s2 = pd.Series(a)
s2

0      1
1      2
2      3
3    444
4     75
dtype: int32

### Eleman İşlemleri

In [18]:
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [19]:
s.keys

<bound method Series.keys of a     99
b     22
c    232
d     94
e      5
dtype: int64>

In [21]:
list(s.items())

[('a', 99), ('b', 22), ('c', 232), ('d', 94), ('e', 5)]

In [22]:
"a" in s # eleman sorgulama

True

In [23]:
"f" in s

False

In [25]:
s[["b","d"]] # fancy indexing

b    22
d    94
dtype: int64

## Pandas DataFrame

Sabit veri tipli olmadığı için veri manipülasyonu işlemleri için Numpy yerine tercih edilir.

In [26]:
l = [1,2,39,67,90]
pd.DataFrame(l, columns = ["variables"])

   variables
0          1
1          2
2         39
3         67
4         90

In [30]:
m = np.arange(1,10).reshape((3,3))
pd.DataFrame(m, columns = ["var1", "var2","var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [31]:
df = pd.DataFrame(m, columns = ["var1", "var2","var3"])
df.head(2)

   var1  var2  var3
0     1     2     3
1     4     5     6

In [32]:
df.columns = ["v1","v2","v3"] # sütun isimlerini değiştirme
df

   v1  v2  v3
0   1   2   3
1   4   5   6
2   7   8   9

In [33]:
type(df)

pandas.core.frame.DataFrame

In [34]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['v1', 'v2', 'v3'], dtype='object')]

In [35]:
df.shape

(3, 3)

In [36]:
df.ndim

2

In [37]:
df.size

9

In [38]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [39]:
type(df.values) # !!

numpy.ndarray

### Eleman İşlemleri

In [41]:
a1 = np.random.randint(10, size=5)
a2 = np.random.randint(10, size=5)
a3 = np.random.randint(10, size=5)
d = {"var1":a1, "var2":a2, "var3":a3}
d

{'var1': array([4, 1, 4, 2, 7]),
 'var2': array([9, 0, 9, 9, 0]),
 'var3': array([9, 7, 8, 7, 8])}

In [42]:
df = pd.DataFrame(d)
df

   var1  var2  var3
0     4     9     9
1     1     0     7
2     4     9     8
3     2     9     7
4     7     0     8

In [43]:
df.index = ["a","b","c","d","e"]
df

   var1  var2  var3
a     4     9     9
b     1     0     7
c     4     9     8
d     2     9     7
e     7     0     8

In [44]:
df["c":"e"]

   var1  var2  var3
c     4     9     8
d     2     9     7
e     7     0     8

In [45]:
df.drop("a", axis = 0) # axis ile satır olduğunu belirtiyoruz

   var1  var2  var3
b     1     0     7
c     4     9     8
d     2     9     7
e     7     0     8

In [46]:
df # orijinal dataframe değişmedi

   var1  var2  var3
a     4     9     9
b     1     0     7
c     4     9     8
d     2     9     7
e     7     0     8

In [47]:
df.drop("a", axis = 0, inplace = True) # yeniden atama olmadan orijinali değiştirir
df

   var1  var2  var3
b     1     0     7
c     4     9     8
d     2     9     7
e     7     0     8

In [48]:
l = ["c","e"]
df.drop(l, axis = 0) #fancy ile silme (orijinal değişmedi, 'inplace = True' yok!)

   var1  var2  var3
b     1     0     7
d     2     9     7

In [49]:
"var1" in df # eleman sorgulama

True

In [51]:
df["var4"] = df["var1"] * df["var2"] # yeni sütun oluşturmak ! var4 önceden yoktu !
df

   var1  var2  var3  var4
b     1     0     7     0
c     4     9     8    36
d     2     9     7    18
e     7     0     8     0

In [52]:
df.drop("var4", axis = 1, inplace = True) # sütun silme
df

   var1  var2  var3
b     1     0     7
c     4     9     8
d     2     9     7
e     7     0     8

In [53]:
l = ["var1","var2"]
df.drop(l, axis = 1)

   var3
b     7
c     8
d     7
e     8